docs/benchmarks/nginx-2026-09-13/diag-proxy-rut-wrk.log
Running 3s test @ http://127.0.0.1:8087/proxy
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.25ms  808.97us  17.61ms   95.50%
    Req/Sec     4.84k   485.50     8.26k    95.08%
  29349 requests in 3.10s, 32.72MB read
Requests/sec:   9467.42
Transfer/sec:     10.56MB